
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do industry-employment.do 

. clear all

. import delimited "../../derived/crosswalk/ces2industry.csv", varnames(1) clea
> r case(preserve)
(3 vars, 89 obs)

. tempfile ces

. save `ces', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St27503.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St27503.000001 saved

. 
. import delimited "../../raw/bls/industry-employment/ces-2020-may.csv", varnam
> es(1) clear case(preserve)
(3 vars, 881 obs)

. merge 1:1 ces_industry using `ces', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                89  
    -----------------------------------------

. 
. replace growth = growth * employment
(89 real changes made)

. collapse (sum) employment growth, by(industry_code)

. replace growth = growth / employment
(88 real changes made)

. 
. summarize employment, detail

                      (sum) employment
-------------------------------------------------------------
      Percentiles      Smallest
 1%         23.7           23.7
 5%         64.9           36.7
10%        114.3           50.5       Obs                  88
25%       407.55           54.5       Sum of Wgt.          88

50%        834.1                      Mean           1732.533
                        Largest       Std. Dev.      2309.036
75%       2135.7           8042
90%       4250.5           8928       Variance        5331647
95%       7855.2         9707.6       Skewness       2.495803
99%      12303.1        12303.1       Kurtosis        9.52371

. display r(sum)
152462.9

. 
. save "industry-employment.dta", replace
file industry-employment.dta saved

. 
end of do-file
