
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do industry-employment.do 

. clear all

. import delimited "../../derived/crosswalk/ces2industry.csv", varnames(1) clea
> r case(preserve)
(3 vars, 89 obs)

. tempfile ces

. save `ces', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St47274.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St47274.000001 saved

. 
. import delimited "../../raw/bls/industry-employment/ces-2020-apr.csv", varnam
> es(1) clear case(preserve)
(3 vars, 881 obs)

. merge 1:1 ces_industry using `ces', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                89  
    -----------------------------------------

. 
. replace growth = growth * employment
(88 real changes made)

. collapse (sum) employment growth, by(industry_code)

. replace growth = growth / employment
(87 real changes made)

. 
. summarize employment, detail

                      (sum) employment
-------------------------------------------------------------
      Percentiles      Smallest
 1%         13.9           13.9
 5%         58.5           23.1
10%          105           49.6       Obs                  88
25%        335.9           50.5       Sum of Wgt.          88

50%       704.95                      Mean           1489.115
                        Largest       Std. Dev.      1907.357
75%       1869.7         6626.7
90%       3574.3         7319.2       Variance        3638012
95%       6384.3         7568.2       Skewness       2.116408
99%       9166.7         9166.7       Kurtosis       7.199799

. display r(sum)
131042.1

. 
. save "industry-employment.dta", replace
file industry-employment.dta saved

. 
end of do-file
