
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do filter.do 

. clear all 

. import delimited "ces.txt", delimiters(tab)
(5 vars, 7,722,125 obs)

. 
. keep if year==2020 & inlist(period, "M02", "M03", "M04")
(7,669,140 observations deleted)

. keep if regexm(series_id, "CES........01")
(51,047 observations deleted)

. generate str ces_industry = substr(series_id, 4, 8)

. 
. rename value employment

. drop footnote_codes

. reshape wide employment, i(ces_industry) j(period) string
(note: j = M02 M03 M04)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                     1938   ->     881
Number of variables                   5   ->       6
j variable (3 values)            period   ->   (dropped)
xij variables:
                             employment   ->   employmentM02 employmentM03 empl
> oymentM04
-----------------------------------------------------------------------------

. 
. generate growth = employmentM04/employmentM02 * 100 - 100
(705 missing values generated)

. rename employmentM04 employment

. order ces_industry employment

. keep ces_industry employment growth

. 
. export delimited "ces-2020-apr.csv", replace
(note: file ces-2020-apr.csv not found)
file ces-2020-apr.csv saved

. 
end of do-file
