
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501706328764
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do employment-matrix.do 

. * crosswalk
. clear all 

. import delimited "../../derived/crosswalk/naics2industry.csv", varnames(1) cl
> ear
(encoding automatically selected: ISO-8859-1)
(3 vars, 87 obs)

. tempfile naics

. save `naics', replace
(file /var/folders/f4/7drmhl1d5kj3wp1r33jvx32m0000gn/T//St03646.000001 not
    found)
file /var/folders/f4/7drmhl1d5kj3wp1r33jvx32m0000gn/T//St03646.000001 saved
    as .dta format

. 
. clear all

. import excel "../../raw/bls/employment-matrix/matrix.xlsx", cellrange(A1:G107
> 532) sheet("Matrix") firstrow
(7 vars, 107,531 obs)

. 
. * drop all summaries
. keep if Occupationtype=="Line item" & Industrytype=="Line item"
(74,571 observations deleted)

. drop if Industrycode=="TE1100"
(621 observations deleted)

. 
. clonevar naics_6d = Industrycode

. replace naics_6d = subinstr(naics_6d, "A", "0",.)
(2,327 real changes made)

. replace naics_6d = subinstr(naics_6d, "A", "0",.)
(0 real changes made)

. replace  naics_6d = subinstr(naics_6d, "-", "0",.)
(14 real changes made)

. destring naics_6d, force replace
naics_6d: all characters numeric; replaced as long

. 
. generate naics_3d = int(naics_6d/1000)

. rename Occupationcode SOCCode

. 
. * aggregate by our sector definitions
. merge m:1 naics_3d using `naics', keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            30,687  
    -----------------------------------------

. collapse (sum) Employment, by(industry_code SOCCode)

. 
. keep SOCCode industry_code Employment

. save "matrix.dta", replace
file matrix.dta saved

. 
end of do-file
