
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do read.do 

. clear all

. 
. local months 02 04 05

. local variables raw_visitor_counts raw_visit_counts

. 
. * read industry aggregator
. import delimited "../../derived/crosswalk/naics2industry.csv", varnames(1) cl
> ear
(3 vars, 87 obs)

. tempfile naics2industry

. save `naics2industry', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St39315.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St39315.000001 saved

. 
. clear

. tempfile patterns

. save `patterns', replace emptyok
(note: dataset contains 0 observations)
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St39315.000002 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St39315.000002 saved

. foreach m in `months' {
  2.         import delimited "../../../input/safegraph-industry-location/naics
> -zip-`m'.csv", clear varnames(1)
  3.         
.         generate month = `m'
  4.         
.         append using `patterns' 
  5.         save `patterns', replace
  6. }
(6 vars, 1,153,154 obs)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St39315.000002 saved
(6 vars, 1,130,823 obs)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St39315.000002 saved
(6 vars, 1,145,889 obs)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St39315.000002 saved

. 
. * aggregate to 3-digit naics
. generate naics_3d = int(naics_code/1000)
(21,636 missing values generated)

. keep if iso_country_code == "US"
(2 observations deleted)

. drop iso_country_code

. rename postal_code zip

. 
. * missing values
. inspect naics_3d zip

naics_3d:                                       Number of Observations
-----------                            ---------------------------------------
                                             Total      Integers   Nonintegers
|          #                 Negative            -             -             -
|          #                 Zero                -             -             -
|          #                 Positive    3,408,230     3,408,230             -
|          #   #                       -----------   -----------   -----------
|          #   #             Total       3,408,230     3,408,230             -
|  .   .   #   #   #         Missing        21,634
+----------------------                -----------
111                 928                  3,429,864
  (79 unique values)

zip:                                            Number of Observations
------                                 ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #       #   #         Zero                5             5             -
|  #   #   #   #   #         Positive    3,429,859     3,429,859             -
|  #   #   #   #   #                   -----------   -----------   -----------
|  #   #   #   #   #         Total       3,429,864     3,429,864             -
|  #   #   #   #   #         Missing             -
+----------------------                -----------
0                 99999                  3,429,864
(More than 99 unique values)

. drop if missing(naics_3d, zip)
(21,634 observations deleted)

. 
. * convert to our industries
. merge m:1 naics_3d using `naics2industry', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         3,237,324  
    -----------------------------------------

. 
. collapse (sum) `variables', by(industry_code zip month)

. 
. * balance panel
. reshape wide `variables', i(industry_code zip) j(month)
(note: j = 2 4 5)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                  1.7e+06   ->  590030
Number of variables                   5   ->       8
j variable (3 values)             month   ->   (dropped)
xij variables:
                     raw_visitor_counts   ->   raw_visitor_counts2 raw_visitor_
> counts4 raw_visitor_counts5
                       raw_visit_counts   ->   raw_visit_counts2 raw_visit_coun
> ts4 raw_visit_counts5
-----------------------------------------------------------------------------

. reshape long
(note: j = 2 4 5)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                   590030   -> 1.8e+06
Number of variables                   8   ->       5
j variable (3 values)                     ->   month
xij variables:
raw_visitor_counts2 raw_visitor_counts4 raw_visitor_counts5->raw_visitor_counts
raw_visit_counts2 raw_visit_counts4 raw_visit_counts5->raw_visit_counts
-----------------------------------------------------------------------------

. * assume missing data means no visitors
. mvencode `variables', mv(0) override
raw_visito~s: 45067 missing values recoded
raw_visit_~s: 45067 missing values recoded

. 
. rename raw_visitor_counts visitors

. rename raw_visit_counts visits

. 
. generate        time = "_feb" if month == 2
(1,180,060 missing values generated)

. replace         time = "_apr" if month == 4
(590,030 real changes made)

. replace         time = "_may" if month == 5
(590,030 real changes made)

. 
. drop month

. reshape wide visitors visits, i(industry_code zip) j(time) string
(note: j = _apr _feb _may)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                  1.8e+06   ->  590030
Number of variables                   5   ->       8
j variable (3 values)              time   ->   (dropped)
xij variables:
                               visitors   ->   visitors_apr visitors_feb visito
> rs_may
                                 visits   ->   visits_apr visits_feb visits_may
-----------------------------------------------------------------------------

. 
. save "visit-naics-zip.dta", replace
file visit-naics-zip.dta saved

. 
end of do-file
