
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do counterfactual.do 

. clear all

. 
. import delimited "../data/derived/crosswalk/2digit_names.csv", varnames(1) cl
> ear case(preserve)
(2 vars, 20 obs)

. tempfile digit2

. save `digit2', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St41407.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St41407.000001 saved

. 
. use "../data/derived/industry_location_panel.dta"

. 
. * add safegraph visits data
. * only use visits to plants in CBP
. * if not found, assume 0 visits
. merge 1:1 industry_code zip using "../data/derived/visit/visit-naics-zip.dta"
> , nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                       146,601
        from master                   146,601  
        from using                          0  

    matched                           303,017  
    -----------------------------------------

. mvencode visit*, mv(0) override
visitors_apr: 146601 missing values recoded
  visits_apr: 146601 missing values recoded
visitors_feb: 146601 missing values recoded
  visits_feb: 146601 missing values recoded
visitors_may: 146601 missing values recoded
  visits_may: 146601 missing values recoded

. 
. merge m:1 industry_code using "../data/derived/visit/visit-change.dta", nogen
>  keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           449,618  
    -----------------------------------------

. 
. * when either is very small, do not use that cell, use zip code average
. egen minvisit = rmin(visits_feb visits_may )

. generate ln_visit_change = cond(minvisit > 10, ln(visits_may) - ln(visits_feb
> ), ln(1 + visit_change / 100))
(21,518 missing values generated)

. 
. * winsorize change
. summarize ln_visit_change, detail

                       ln_visit_change
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.458515      -6.502254
 5%    -1.677389      -5.802118
10%     -1.16586      -5.673588       Obs             428,100
25%    -.6204664      -5.611777       Sum of Wgt.     428,100

50%    -.3335903                      Mean          -.4528662
                        Largest       Std. Dev.      .6019252
75%     -.152202       5.090507
90%     .1077274       5.133836       Variance        .362314
95%     .2930875       5.534909       Skewness      -1.228699
99%     .8206936       5.752199       Kurtosis       8.055012

. replace ln_visit_change = r(p1) if ln_visit_change < r(p1)
(4,281 real changes made)

. replace ln_visit_change = r(p99) if ln_visit_change > r(p99)
(25,799 real changes made)

. 
. * from employment regression, only F2F customer contact matters
. generate chi = customer_interact_share/100

. generate gamma = chi/(1-chi)

. generate contact_ratio = exp(ln_visit_change)

. * Eq 6 from the paper
. generate labor_subsidy = 100 - 100 * (1 - chi*contact_ratio) * (contact_ratio
> )^gamma / (1-chi)

. summarize labor_subsidy [aw=employment_weight]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
labor_subs~y | 442,887    116441.9     39.8762   4626.439  -1.42e-14    1686128

. 
. save "wage_subsidy.dta", replace
file wage_subsidy.dta saved

. 
. do "aggregate2digit.do"

. generate naics_2d = int(industry_code/10)

. replace naics_2d = 31 if (naics_2d>=31) & (naics<=33)
(25,843 real changes made)

. replace naics_2d = 44 if (naics_2d>=44) & (naics<=45)
(30,239 real changes made)

. replace naics_2d = 48 if (naics_2d>=48) & (naics<=49)
(3,411 real changes made)

. 
end of do-file

. * weighted cost ratio
. replace labor_subsidy = labor_subsidy * employment_weight
(448,670 real changes made, 1,209 to missing)

. 
. collapse (sum) labor_subsidy employment_weight, by(naics_2d)

. * merge on names
. merge 1:1 naics_2d using `digit2', nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                19  
    -----------------------------------------

. 
. replace labor_subsidy = round(labor_subsidy/employment_weight, 0.1)
(19 real changes made)

. rename employment_weight employment

. replace employment = round(employment)
(19 real changes made)

. 
. * calculate weighted average
. summarize labor_subsidy [fw=employment], meanonly

. scalar average = r(mean)

. scalar N = r(N)

. 
. gsort -labor_subsidy

. 
. * add a row for average
. set obs 20
number of observations (_N) was 19, now 20

. replace industry_label = "Average" in 20
(1 real change made)

. replace labor_subsidy = average in 20
(1 real change made)

. replace employment = N in 20
(1 real change made)

. 
. order industry_label labor_subsidy employment

. export delimited "cost_by_naics2.csv", replace
(note: file cost_by_naics2.csv not found)
file cost_by_naics2.csv saved

. 
end of do-file
