
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do counterfactual.do 

. clear all

. 
. use "../data/derived/industry_location_panel.dta", clear

. /* 
> Calibrate epsilon to gamma=1.04 in
> 
> Ciccone, Antonio, and Robert Hall. 1996. “Productivity and the Density of Eco
> nomic Activity.” 
> The American Economic Review 86 (1): 54–70.
> 
> page 62.
> 
> density^agglomeration = density^(epsilon * chi)
> */
. scalar agglomeration = 0.04

. generate LHS = agglomeration * ln(population_density)
(5,984 missing values generated)

. generate RHS = (communication_share/100) * ln(population_density)
(5,984 missing values generated)

. 
. regress LHS RHS [aw=employment_weight]
(sum of wgt is 116,253.349869885)

      Source |       SS           df       MS      Number of obs   =   442,430
-------------+----------------------------------   F(1, 442428)    >  99999.00
       Model |  616.080648         1  616.080648   Prob > F        =    0.0000
    Residual |  1335.34982   442,428  .003018231   R-squared       =    0.3157
-------------+----------------------------------   Adj R-squared   =    0.3157
       Total |  1951.43047   442,429   .00441072   Root MSE        =    .05494

------------------------------------------------------------------------------
         LHS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         RHS |    .026333   .0000583   451.80   0.000     .0262187    .0264472
       _cons |   .1821827   .0001805  1009.45   0.000      .181829    .1825364
------------------------------------------------------------------------------

. scalar epsilon = _b[RHS]

. generate chi = communication_share/100

. generate gamma = chi/(1-chi)

. 
. * Eq 4
. generate contact = population_density^(epsilon*(1-chi))
(5,527 missing values generated)

. 
. * current number of contacts
. summarize contact [aw=employment_weight]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
     contact | 442,887    116441.9    1.098867   .0611941          0   1.287611

. scalar current_contact = r(mean)

. 
. * target contact is half
. scalar target_contact = current_contact * 0.5

. 
. * loop to find the cap
. scalar cap = 10000

. scalar average = current_contact 

. generate counterfactual = .
(449,618 missing values generated)

. while average > target_contact {
  2.         quietly replace counterfactual = min(contact, min(population_densi
> ty, cap)^(epsilon*(1-chi)))
  3.         quietly summarize counterfactual [aw=employment_weight]
  4.         scalar average = r(mean)
  5.         scalar cap = 0.90*cap
  6. }

. 
. generate contact_ratio = counterfactual / contact
(5,984 missing values generated)

. * Eq 6 from the paper
. generate labor_subsidy = 100 - 100 * (1 - chi*contact_ratio) * (contact_ratio
> )^gamma / (1-chi)
(5,984 missing values generated)

. summarize labor_subsidy [aw=employment_weight]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
labor_subs~y | 442,430   116253.35    18.54669   6.768195   3.113107   37.49002

. 
. * compute for nyc
. merge m:1 zip using "nyc_zip.dta", keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                       443,603
        from master                   443,603  (_merge==1)
        from using                          0  (_merge==2)

    matched                             6,015  (_merge==3)
    -----------------------------------------

. generate nyc = (_m==3)

. summarize population_density if nyc==1 [aw=employment_weight]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
population~y |   6,014  3959.52193    19323.45   12220.87          0   57231.17

. summarize labor_subsidy if nyc==1 [aw=employment_weight]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
labor_subs~y |   5,844  3882.99624    21.27609   6.528568   5.396753   37.49002

. 
. save "wage_subsidy.dta", replace
file wage_subsidy.dta saved

. 
. do "aggregate2digit.do"

. generate naics_2d = int(industry_code/10)

. replace naics_2d = 31 if (naics_2d>=31) & (naics<=33)
(25,843 real changes made)

. replace naics_2d = 44 if (naics_2d>=44) & (naics<=45)
(30,239 real changes made)

. replace naics_2d = 48 if (naics_2d>=48) & (naics<=49)
(3,411 real changes made)

. 
end of do-file

. * weighted cost ratio
. replace labor_subsidy = labor_subsidy * employment_weight
(443,634 real changes made, 1,204 to missing)

. 
. collapse (sum) labor_subsidy employment_weight, by(naics_2d)

. * merge on names
. merge 1:1 naics_2d using `digit2', nogen keep(master match)
invalid file specification
r(198);

end of do-file
r(198);
