
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do create-index.do 

. clear all

. 
. import delimited "../data/derived/crosswalk/industry.csv", varnames(1) clear 
> case(preserve)
(3 vars, 90 obs)

. merge 1:1 industry_code using "../data/clean/industry-employment/industry-emp
> loyment.dta", nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             2
        from master                         2  
        from using                          0  

    matched                                88  
    -----------------------------------------

. rename employment ces_employment

. tempfile industry

. save `industry', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St17166.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St17166.000001 saved

. 
. 
. import delimited "../data/derived/occupation/naics_risk.csv", varnames(1) cle
> ar
(19 vars, 84 obs)

. merge m:1 industry_code using `industry', nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                84  
    -----------------------------------------

. 
. local vars teamwork_share customer_share presence_share teamwork_interact_sha
> re customer_interact_share presence_interact_share 

. keep industry_code industry_label `vars'

. order industry_code industry_label `vars'

. 
. * merge on CES employment to be able to calculate weighted statistics
. merge 1:1 industry_code using `industry', nogen keep(master match) keepusing(
> ces_employment)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                84  
    -----------------------------------------

. 
. foreach X of var *_share {
  2.         replace `X' = round(`X')
  3.         format `X' %10.0f
  4. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. foreach X of var ces_employment {
  2.         replace `X' = round(`X'*10)/10
  3.         format `X' %11.1f
  4. }
(58 real changes made)

. 
. label variable teamwork_share "Workers in teamwork-intensive occupations (per
> cent)"

. label variable customer_share "Workers in customer-facing occupations (percen
> t)"

. label variable presence_share "Workers in occupations requiring physical pres
> ence (percent)"

. 
. label variable teamwork_interact_share "Workers in teamwork-intensive occupat
> ions who cannot work from home (percent)"

. label variable customer_interact_share "Workers in customer-facing occupation
> s who cannot work from home (percent)"

. label variable presence_interact_share "Workers in occupations requiring phys
> ical presence who cannot work from home (percent)"
note: label truncated to 80 characters

. 
. label variable ces_employment "Industry employment (thousand persons)"

. 
. gsort -customer_interact_share

. 
. save "../data/derived/industry-index.dta", replace
file ../data/derived/industry-index.dta saved

. export delimited "../data/derived/industry-index.csv", replace
(note: file ../data/derived/industry-index.csv not found)
file ../data/derived/industry-index.csv saved

. 
end of do-file
