
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do create-index.do 

. clear all

. 
. import delimited "../data/derived/crosswalk/industry.csv", varnames(1) clear 
> case(preserve)
(3 vars, 90 obs)

. merge 1:1 industry_code using "../data/clean/industry-employment/industry-emp
> loyment.dta", nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             2
        from master                         2  
        from using                          0  

    matched                                88  
    -----------------------------------------

. rename employment ces_employment

. tempfile industry

. save `industry', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St01780.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St01780.000001 saved

. 
. 
. import delimited "../data/derived/occupation/naics_risk.csv", varnames(1) cle
> ar
(22 vars, 84 obs)

. merge m:1 industry_code using `industry', nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                84  
    -----------------------------------------

. 
. local vars teamwork_share customer_share presence_share communication_share a
> ffected_share face2face_share

. keep industry_code industry_label `vars'
variable face2face_share not found
r(111);

end of do-file
r(111);
