
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do employment-growth.do 

. clear all

. 
. use "../data/derived/industry_location_panel.dta", clear

. 
. collapse (firstnm) ces_employment growth customer_* teamwork_* presence_*, by
> (industry_code industry_label)

. 
. merge 1:1 industry_code using "../data/derived/visit/visit-change.dta", nogen
>  keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                81  
    -----------------------------------------

. * if industry is not in SafeGraph, replace with average visit change in ZIP c
> ode of industry establishments
. replace visit_change = local_visit_change if missing(visit_change)
(18 real changes made)

. 
. generate str label = ""
(81 missing values generated)

. replace label = industry_label if inlist(industry_code, 487, 722, 442, 448, 4
> 52, 519, 486, 113, 451, 721, 446)
variable label was str1 now str45
(11 real changes made)

. 
. * transformations for regressions
. foreach X of var growth visit_change {
  2.         generate ln_`X' = ln(1 + `X' / 100)
  3. }
(2 missing values generated)
(3 missing values generated)

. 
. foreach X of var *share {
  2.         replace `X' = `X' / 100
  3. }
variable customer_share was byte now float
(81 real changes made)
variable customer_interact_share was byte now float
(81 real changes made)
variable teamwork_share was byte now float
(81 real changes made)
variable teamwork_interact_share was byte now float
(81 real changes made)
variable presence_share was byte now float
(70 real changes made)
variable presence_interact_share was byte now float
(70 real changes made)

. 
. foreach X in customer teamwork {
  2.         generate `X'_wfh_share = (`X'_share - `X'_interact_share) / `X'_sh
> are
  3.         generate visit_X_`X' = ln_visit_change * `X'_interact_share
  4. }
(3 missing values generated)
(3 missing values generated)

. 
. label variable ln_growth "Employment change (log)"

. 
. label variable customer_interact_share  "Customer-facing~workers \hspace*{1em
> }(share, [0,1])"

. label variable teamwork_interact_share  "Teamwork-intensive~workers \hspace*{
> 1em}(share, [0,1])"

. label variable presence_interact_share  "Presence-intensive~workers \hspace*{
> 1em}(share, [0,1])"

. 
. label variable ln_visit_change                  "Change~in~number~of \hspace*
> {1em}monthly visits (log)"

. label variable visit_X_customer                 "\hspace*{1em}$\times$~custom
> er-facing~share \hspace*{1em}([0,1])"

. label variable visit_X_teamwork                 "\hspace*{1em}$\times$~teamwo
> rk-intensive~share \hspace*{1em}([0,1])"

. 
. tw ///
>         (scatter ln_growth visit_X_customer,  msymbol(circle_hollow) mlabel(l
> abel)), ///
>         scheme(s2mono) graphregion(color(white)) ///
>         ytitle("Change in employment between Feb and May (log)" ) ///
>         xtitle("Predicted change in communication (log)") ///
>         legend(off) ///
>         graphregion(margin(1 40 1 1)) aspect(1)

. 
. graph export "../text/fig5b.eps", replace
(file ../text/fig5b.eps written in EPS format)

. graph export "../text/fig5b.pdf", replace
(file ../text/fig5b.pdf written in PDF format)

. 
. 
. eststo: regress ln_growth customer_interact_share teamwork_interact_share pre
> sence_interact_share, robust

Linear regression                               Number of obs     =         79
                                                F(3, 75)          =       3.59
                                                Prob > F          =     0.0176
                                                R-squared         =     0.1875
                                                Root MSE          =     .21944

------------------------------------------------------------------------------
             |               Robust
   ln_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
customer_i~e |  -.4181217    .164463    -2.54   0.013    -.7457488   -.0904947
teamwork_i~e |   .0236076   .5629201     0.04   0.967    -1.097787    1.145002
presence_i~e |   .0792712   .1246066     0.64   0.527    -.1689578    .3275002
       _cons |  -.1099897   .0534767    -2.06   0.043    -.2165208   -.0034587
------------------------------------------------------------------------------
(est1 stored)

. eststo: regress ln_growth customer_interact_share teamwork_interact_share pre
> sence_interact_share ln_visit_change, robust

Linear regression                               Number of obs     =         78
                                                F(4, 73)          =       5.62
                                                Prob > F          =     0.0005
                                                R-squared         =     0.3019
                                                Root MSE          =     .20558

------------------------------------------------------------------------------
             |               Robust
   ln_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
customer_i~e |  -.4626853   .1517596    -3.05   0.003    -.7651419   -.1602288
teamwork_i~e |   .2538213   .5318923     0.48   0.635    -.8062386    1.313881
presence_i~e |  -.0513617   .1362478    -0.38   0.707    -.3229032    .2201797
ln_visit_c~e |   .1849102   .0629189     2.94   0.004     .0595129    .3103074
       _cons |   .0016639   .0552407     0.03   0.976    -.1084307    .1117586
------------------------------------------------------------------------------
(est2 stored)

. eststo: regress ln_growth customer_interact_share teamwork_interact_share pre
> sence_interact_share ln_visit_change visit_X_*, robust

Linear regression                               Number of obs     =         78
                                                F(6, 71)          =       6.94
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4347
                                                Root MSE          =     .18759

------------------------------------------------------------------------------
             |               Robust
   ln_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
customer_i~e |   .0116084   .1729289     0.07   0.947    -.3332021    .3564188
teamwork_i~e |   .6001504   .8389281     0.72   0.477    -1.072625    2.272926
presence_i~e |  -.0047979   .1129484    -0.04   0.966    -.2300105    .2204148
ln_visit_c~e |  -.1186371   .1314952    -0.90   0.370     -.380831    .1435568
visit_X_cu~r |   1.020831   .4466773     2.29   0.025     .1301817     1.91148
visit_X_te~k |   .3322733   1.499757     0.22   0.825    -2.658157    3.322704
       _cons |  -.1697359   .0790975    -2.15   0.035     -.327452   -.0120199
------------------------------------------------------------------------------
(est3 stored)

. 
. esttab using "../text/regression.tex", r2 star(* .1 ** .05 *** .01) se b(3) /
> //
>         order(customer_interact_share teamwork_interact_share presence_intera
> ct_share ln_visit_change visit_X_customer visit_X_customer) ///
>         noconstant nonote alignment(D{.}{.}{-1}) mtitles("" "" "" "") ///
>         wrap replace label substitute() ///
>         prehead(`"{\setlength{\tabcolsep}{-2pt}"' `"{\def\sym#1{\ifmmode^{#1}
> \else\(^{#1}\)\fi}\begin{tabular}{l*{4}{D{.}{.}{-1}}}\hline\hline"')
(output written to ../text/regression.tex)

. 
end of do-file
