
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do employment-growth.do 

. clear all

. 
. use "../data/derived/industry_location_panel.dta", clear

. 
. collapse (firstnm) ces_employment growth customer_* teamwork_* presence_*, by
> (industry_code industry_label)

. 
. merge 1:1 industry_code using "../data/derived/visit/visit-change.dta", nogen
>  keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                81  
    -----------------------------------------

. * if industry is not in SafeGraph, replace with average visit change in ZIP c
> ode of industry establishments
. replace visit_change = local_visit_change if missing(visit_change)
(18 real changes made)

. 
. generate str label = ""
(81 missing values generated)

. replace label = industry_label if inlist(industry_code, 487, 722, 442, 448, 4
> 52, 519, 486, 113, 451, 721, 446)
variable label was str1 now str45
(11 real changes made)

. 
. tw ///
> (scatter growth customer_interact_share,  msymbol(circle_hollow) mlabel(label
> )), ///
> scheme(s2mono) graphregion(color(white)) ///
> ytitle("Change in employment between Feb and May (%)" ) ///
> xtitle("Share of workers in customer facing occupations (%)") ///
> legend(off) ///
> graphregion(margin(1 40 1 1)) aspect(1)

. 
. graph export "../text/fig5b.eps", replace
(file ../text/fig5b.eps written in EPS format)

. graph export "../text/fig5b.pdf", replace
(file ../text/fig5b.pdf written in PDF format)

. 
. foreach X in customer teamwork presence {
  2.         generate `X'_resilient_share = `X'_share - `X'_interact_share
  3.         generate visit_X_`X'_res = visit_change * `X'_resilient_share / 10
> 0
  4.         generate visit_X_`X'_aff = visit_change * `X'_interact_share / 100
  5. }
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)
(2 missing values generated)

.         
. regress growth customer_share teamwork_share presence_share, robust

Linear regression                               Number of obs     =         79
                                                F(3, 75)          =       7.87
                                                Prob > F          =     0.0001
                                                R-squared         =     0.2568
                                                Root MSE          =     14.247

------------------------------------------------------------------------------
             |               Robust
      growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
customer_s~e |  -.1850973   .0939995    -1.97   0.053    -.3723539    .0021594
teamwork_s~e |   .5184964    .111249     4.66   0.000     .2968769    .7401159
presence_s~e |   .1706908   .0747569     2.28   0.025     .0217675    .3196141
       _cons |  -23.55196   4.217306    -5.58   0.000    -31.95326   -15.15066
------------------------------------------------------------------------------

. regress growth customer_interact_share teamwork_interact_share presence_inter
> act_share, robust

Linear regression                               Number of obs     =         79
                                                F(3, 75)          =       3.49
                                                Prob > F          =     0.0198
                                                R-squared         =     0.1752
                                                Root MSE          =     15.008

------------------------------------------------------------------------------
             |               Robust
      growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
customer_i~e |  -.2719762   .1075085    -2.53   0.014    -.4861441   -.0578083
teamwork_i~e |   .0169286   .3712247     0.05   0.964    -.7225888    .7564461
presence_i~e |   .0599678   .0841333     0.71   0.478    -.1076344      .22757
       _cons |   -9.79693   3.785706    -2.59   0.012    -17.33844   -2.255417
------------------------------------------------------------------------------

. 
. regress growth visit_change visit_X_*, robust

Linear regression                               Number of obs     =         79
                                                F(7, 71)          =      12.75
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5868
                                                Root MSE          =     10.918

------------------------------------------------------------------------------
             |               Robust
      growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
visit_change |   .3702219   .1265632     2.93   0.005      .117862    .6225817
visit_X_cu~s |  -1.147368   .5360192    -2.14   0.036     -2.21616   -.0785757
visit_X_cu~f |   .5981393   .1996491     3.00   0.004     .2000502    .9962284
visit_X_te~s |  -.8806714   .2644349    -3.33   0.001     -1.40794   -.3534033
visit_X_te~f |  -.1848616   .6184427    -0.30   0.766    -1.418001    1.048278
visit_X_pr~s |    .061753     .21052     0.29   0.770     -.358012    .4815179
visit_X_pr~f |  -.5099755   .2047084    -2.49   0.015    -.9181524   -.1017986
       _cons |  -4.434232   2.950784    -1.50   0.137    -10.31793    1.449464
------------------------------------------------------------------------------

. 
end of do-file
