
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do employment-growth.do 

. clear all

. 
. use "../data/derived/industry_location_panel.dta", clear

. 
. collapse (firstnm) ces_employment growth customer_* teamwork_* presence_*, by
> (industry_code industry_label)

. 
. merge 1:1 industry_code using "../data/derived/visit/visit-change.dta", nogen
>  keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                81  
    -----------------------------------------

. * if industry is not in SafeGraph, replace with average visit change in ZIP c
> ode of industry establishments
. replace visit_change = local_visit_change if missing(visit_change)
(18 real changes made)

. 
. generate str label = ""
(81 missing values generated)

. replace label = industry_label if inlist(industry_code, 487, 722, 442, 448, 4
> 52, 519, 486, 113, 451, 721, 446)
variable label was str1 now str45
(11 real changes made)

. 
. tw ///
> (scatter growth customer_interact_share,  msymbol(circle_hollow) mlabel(label
> )), ///
> scheme(s2mono) graphregion(color(white)) ///
> ytitle("Change in employment between Feb and May (%)" ) ///
> xtitle("Share of workers in customer facing occupations (%)") ///
> legend(off) ///
> graphregion(margin(1 40 1 1)) aspect(1)

. 
. graph export "../text/fig5b.eps", replace
(file ../text/fig5b.eps written in EPS format)

. graph export "../text/fig5b.pdf", replace
(file ../text/fig5b.pdf written in PDF format)

. 
. * transformations for regressions
. foreach X of var growth visit_change {
  2.         generate ln_`X' = ln(1 + `X' / 100)
  3. }
(2 missing values generated)
(3 missing values generated)

. 
. foreach X of var *share {
  2.         replace `X' = `X' / 100
  3. }
variable customer_share was byte now float
(81 real changes made)
variable customer_interact_share was byte now float
(81 real changes made)
variable teamwork_share was byte now float
(81 real changes made)
variable teamwork_interact_share was byte now float
(81 real changes made)
variable presence_share was byte now float
(70 real changes made)
variable presence_interact_share was byte now float
(70 real changes made)

. 
. foreach X in customer teamwork {
  2.         generate `X'_wfh_share = (`X'_share - `X'_interact_share) / `X'_sh
> are
  3.         generate visit_X_`X' = ln_visit_change * `X'_wfh_share
  4. }
(3 missing values generated)
(3 missing values generated)

. 
. label variable ln_growth "Employment change (log)"

. 
. label variable customer_share "Customer-facing workers (share, [0,1])"

. label variable teamwork_share "Teamwork-intensive workers (share, [0,1])"

. label variable presence_interact_share "Presence-intensive workers (share, [0
> ,1])"

. 
. label variable customer_interact_share "   of which face-to-face intensive"

. label variable teamwork_interact_share "   of which face-to-face intensive"

. 
. label variable ln_visit_change "Change in number of monthly visits (log)"

. label variable visit_X_customer "   X share can work from home (customer)"

. label variable visit_X_teamwork "   X share can work from home (teamwork)"

. 
. eststo: regress ln_growth customer_share teamwork_share presence_interact_sha
> re, robust

Linear regression                               Number of obs     =         79
                                                F(3, 75)          =       7.17
                                                Prob > F          =     0.0003
                                                R-squared         =     0.2454
                                                Root MSE          =      .2064

------------------------------------------------------------------------------
             |               Robust
   ln_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
customer_s~e |  -.2928284   .1377891    -2.13   0.037    -.5673184   -.0183385
teamwork_s~e |   .6766013   .1563255     4.33   0.000     .3651848    .9880177
presence_i~e |   .2235249   .1113842     2.01   0.048     .0016363    .4454136
       _cons |  -.2832966   .0568781    -4.98   0.000    -.3966035   -.1699897
------------------------------------------------------------------------------
(est1 stored)

. eststo: regress ln_growth customer_interact_share teamwork_interact_share pre
> sence_interact_share, robust

Linear regression                               Number of obs     =         79
                                                F(3, 75)          =       3.59
                                                Prob > F          =     0.0175
                                                R-squared         =     0.1834
                                                Root MSE          =     .21472

------------------------------------------------------------------------------
             |               Robust
   ln_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
customer_i~e |   -.408574   .1583391    -2.58   0.012    -.7240017   -.0931464
teamwork_i~e |   .1073706   .5308893     0.20   0.840    -.9502151    1.164956
presence_i~e |   .0785976   .1197762     0.66   0.514    -.1600088    .3172041
       _cons |   -.115196    .051875    -2.22   0.029    -.2185364   -.0118557
------------------------------------------------------------------------------
(est2 stored)

. eststo: regress ln_growth customer_interact_share teamwork_interact_share pre
> sence_interact_share ln_visit_change, robust

Linear regression                               Number of obs     =         78
                                                F(4, 73)          =       6.19
                                                Prob > F          =     0.0002
                                                R-squared         =     0.3073
                                                Root MSE          =      .1998

------------------------------------------------------------------------------
             |               Robust
   ln_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
customer_i~e |  -.4533396   .1418884    -3.20   0.002    -.7361228   -.1705565
teamwork_i~e |   .3434905   .4862987     0.71   0.482    -.6257015    1.312683
presence_i~e |  -.0529249   .1275178    -0.42   0.679    -.3070675    .2012178
ln_visit_c~e |   .1875666   .0586468     3.20   0.002     .0706836    .3044495
       _cons |  -.0025604   .0531134    -0.05   0.962    -.1084153    .1032944
------------------------------------------------------------------------------
(est3 stored)

. eststo: regress ln_growth customer_interact_share teamwork_interact_share pre
> sence_interact_share ln_visit_change visit_X_*, robust

Linear regression                               Number of obs     =         78
                                                F(6, 71)          =       6.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5931
                                                Root MSE          =     .15527

------------------------------------------------------------------------------
             |               Robust
   ln_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
customer_i~e |  -.2398222   .1095299    -2.19   0.032    -.4582187   -.0214257
teamwork_i~e |   1.203933   .4873889     2.47   0.016     .2321073    2.175759
presence_i~e |   .0831707   .0906629     0.92   0.362     -.097606    .2639474
ln_visit_c~e |   .6441731   .1291648     4.99   0.000     .3866258    .9017203
visit_X_cu~r |   .0007319   .1643109     0.00   0.996    -.3268947    .3283585
visit_X_te~k |  -.8809391   .2168583    -4.06   0.000    -1.313342   -.4485358
       _cons |  -.1351455   .0476111    -2.84   0.006    -.2300793   -.0402116
------------------------------------------------------------------------------
(est4 stored)

. 
. esttab using "../text/regression.tex", r2 star(* .1 ** .05 *** .01) se b(3) o
> rder(customer_share customer_interact_share teamwork_share teamwork_interact_
> share presence_interact_share ln_visit_change visit_X_customer visit_X_custom
> er) noconstant nonote alignment(D{.}{.}{-1}) replace label
(output written to ../text/regression.tex)

. 
end of do-file
