
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do employment-growth.do 

. clear all

. 
. use "../data/derived/industry_location_panel.dta", clear

. 
. collapse (firstnm) ces_employment growth customer_* teamwork_* presence_*, by
> (industry_code industry_label)

. 
. merge 1:1 industry_code using "../data/derived/visit/visit-change.dta", nogen
>  keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                81  
    -----------------------------------------

. * if industry is not in SafeGraph, replace with average visit change in ZIP c
> ode of industry establishments
. replace visit_change = local_visit_change if missing(visit_change)
(18 real changes made)

. 
. generate str label = ""
(81 missing values generated)

. replace label = industry_label if inlist(industry_code, 487, 722, 442, 448, 4
> 52, 519, 486, 113, 451, 721, 446)
variable label was str1 now str45
(11 real changes made)

. 
. * transformations for regressions
. foreach X of var growth visit_change {
  2.         generate ln_`X' = ln(1 + `X' / 100)
  3. }
(2 missing values generated)
(3 missing values generated)

. 
. foreach X of var *share {
  2.         replace `X' = `X' / 100
  3. }
variable customer_share was byte now float
(81 real changes made)
variable customer_interact_share was byte now float
(81 real changes made)
variable teamwork_share was byte now float
(81 real changes made)
variable teamwork_interact_share was byte now float
(81 real changes made)
variable presence_share was byte now float
(70 real changes made)
variable presence_interact_share was byte now float
(70 real changes made)

. 
. foreach X in customer teamwork {
  2.         generate `X'_wfh_share = (`X'_share - `X'_interact_share) / `X'_sh
> are
  3.         generate visit_X_`X' = ln_visit_change * `X'_interact_share
  4. }
(3 missing values generated)
(3 missing values generated)

. 
. label variable ln_growth "Employment change (log)"

. 
. label variable customer_share                   "Customer-facing~workers \hsp
> ace*{1em}(share, [0,1])"

. label variable teamwork_share                   "Teamwork-intensive~workers \
> hspace*{1em}(share, [0,1])"

. label variable presence_interact_share  "Presence-intensive~workers \hspace*{
> 1em}(share, [0,1])"

. 
. label variable customer_interact_share  "\hspace*{1em}of~which~face-to-face \
> hspace*{1em}intensive (share, [0,1])"

. label variable teamwork_interact_share  "\hspace*{1em}of~which~face-to-face \
> hspace*{1em}intensive (share, [0,1])"

. 
. label variable ln_visit_change                  "Change~in~number~of \hspace*
> {1em}monthly visits (log)"

. label variable visit_X_customer                 "\hspace*{1em}$\times$~custom
> er-facing~share \hspace*{1em}([0,1])"

. label variable visit_X_teamwork                 "\hspace*{1em}$\times$~teamwo
> rk-intensive~share \hspace*{1em}([0,1])"

. 
. tw ///
>         (scatter ln_growth visit_X_customer,  msymbol(circle_hollow) mlabel(l
> abel)), ///
>         scheme(s2mono) graphregion(color(white)) ///
>         ytitle("Change in employment between Feb and May (log)" ) ///
>         xtitle("Predicted change in communication (log)") ///
>         legend(off) ///
>         graphregion(margin(1 40 1 1)) aspect(1)

. 
. graph export "../text/fig5b.eps", replace
(file ../text/fig5b.eps written in EPS format)

. graph export "../text/fig5b.pdf", replace
(file ../text/fig5b.pdf written in PDF format)

. 
. 
. eststo: regress ln_growth customer_share teamwork_share presence_interact_sha
> re, robust

Linear regression                               Number of obs     =         79
                                                F(3, 75)          =       5.62
                                                Prob > F          =     0.0016
                                                R-squared         =     0.2208
                                                Root MSE          =     .18647

------------------------------------------------------------------------------
             |               Robust
   ln_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
customer_s~e |  -.3003343   .1157628    -2.59   0.011    -.5309455    -.069723
teamwork_s~e |   .4619765   .1320045     3.50   0.001     .1990101    .7249429
presence_i~e |   .1478245   .0980562     1.51   0.136    -.0475134    .3431623
       _cons |  -.2098672   .0467657    -4.49   0.000    -.3030292   -.1167051
------------------------------------------------------------------------------
(est1 stored)

. eststo: regress ln_growth customer_interact_share teamwork_interact_share pre
> sence_interact_share, robust

Linear regression                               Number of obs     =         79
                                                F(3, 75)          =       3.70
                                                Prob > F          =     0.0154
                                                R-squared         =     0.1999
                                                Root MSE          =     .18895

------------------------------------------------------------------------------
             |               Robust
   ln_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
customer_i~e |  -.3466539   .1314774    -2.64   0.010    -.6085703   -.0847375
teamwork_i~e |  -.2823678   .5287471    -0.53   0.595    -1.335686    .7709504
presence_i~e |   .0765785   .1046861     0.73   0.467    -.1319668    .2851239
       _cons |  -.0732002   .0455736    -1.61   0.112    -.1639874    .0175871
------------------------------------------------------------------------------
(est2 stored)

. eststo: regress ln_growth customer_interact_share teamwork_interact_share pre
> sence_interact_share ln_visit_change, robust

Linear regression                               Number of obs     =         78
                                                F(4, 73)          =       7.32
                                                Prob > F          =     0.0001
                                                R-squared         =     0.3826
                                                Root MSE          =      .1678

------------------------------------------------------------------------------
             |               Robust
   ln_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
customer_i~e |  -.3973515   .1105909    -3.59   0.001    -.6177588   -.1769442
teamwork_i~e |  -.0416469   .4445902    -0.09   0.926    -.9277138    .8444201
presence_i~e |  -.0707399   .0971691    -0.73   0.469    -.2643976    .1229179
ln_visit_c~e |   .2024425   .0565731     3.58   0.001     .0896924    .3151926
       _cons |   .0517497   .0502281     1.03   0.306    -.0483549    .1518542
------------------------------------------------------------------------------
(est3 stored)

. eststo: regress ln_growth customer_interact_share teamwork_interact_share pre
> sence_interact_share ln_visit_change visit_X_*, robust

Linear regression                               Number of obs     =         78
                                                F(6, 71)          =       9.69
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5550
                                                Root MSE          =     .14446

------------------------------------------------------------------------------
             |               Robust
   ln_growth |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
customer_i~e |   .0696918   .1301181     0.54   0.594    -.1897564      .32914
teamwork_i~e |   .3153828    .702322     0.45   0.655    -1.085007    1.715773
presence_i~e |  -.0252469   .0824123    -0.31   0.760    -.1895723    .1390785
ln_visit_c~e |  -.0994729    .095963    -1.04   0.303    -.2908177    .0918718
visit_X_cu~r |   1.005859   .3185755     3.16   0.002     .3706372     1.64108
visit_X_te~k |   .3510607   1.096573     0.32   0.750    -1.835444    2.537565
       _cons |  -.1188335   .0633971    -1.87   0.065    -.2452438    .0075767
------------------------------------------------------------------------------
(est4 stored)

. 
. esttab using "../text/regression.tex", r2 star(* .1 ** .05 *** .01) se b(3) /
> //
>         order(customer_share customer_interact_share teamwork_share teamwork_
> interact_share presence_interact_share ln_visit_change visit_X_customer visit
> _X_customer) ///
>         noconstant nonote alignment(D{.}{.}{-1}) mtitles("" "" "" "") ///
>         wrap replace label substitute() ///
>         prehead(`"{\setlength{\tabcolsep}{-2pt}"' `"{\def\sym#1{\ifmmode^{#1}
> \else\(^{#1}\)\fi}\begin{tabular}{l*{4}{D{.}{.}{-1}}}\hline\hline"')
(output written to ../text/regression.tex)

. 
end of do-file
