
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501706328764
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do headcount.do 

. clear all

. * calculate urban density cutoff
. 
. use "../data/derived/industry-index.dta", clear

. 
. * drop hospitals and clinics
. drop if inlist(industry_code, 621, 622)
(2 observations deleted)

. 
. replace ces_employment = int(ces_employment*1000)
(80 real changes made)

. foreach X of var *_interact_share {
  2.         summarize `X' [fw=ces_employment]
  3.         display "Millions of workers: " r(mean)/100 * r(sum_w) / 1e+6
  4. }

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
teamwork_i~e |116,601,799    11.10034    6.560766          2         34
Millions of workers: 12.943191

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
customer_i~e |116,601,799    23.67583    22.45405          1         89
Millions of workers: 27.60644

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
presence_i~e |116,601,799    9.597957    14.34205          0         65
Millions of workers: 11.191391

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
comm~t_share |116,601,799    27.74979    20.59072          3         89
Millions of workers: 32.356755

. 
. generate naics_2d = industry_code if industry_code<100
(82 missing values generated)

. replace naics_2d = int(industry_code/10) if industry_code>=100
(82 real changes made)

. 
. * employment-weighted average
. foreach X of var *_interact_share {
  2.         replace `X' = `X' * employment
  3.         replace employment = . if missing(`X')
  4. }
employment not found
r(111);

end of do-file
r(111);
