
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do risk-by-density.do 

. clear all

. local indexes teamwork_share customer_share presence_share communication_shar
> e affected_share face2face_share

. use "../data/derived/industry_location_panel.dta", clear

. 
. foreach X of var `indexes' {
  2.         replace `X' = `X' * employment_weight
  3.         replace employment_weight = 0 if missing(`X')
  4. }
variable teamwork_share was byte now float
(449,618 real changes made, 1,209 to missing)
(1,209 real changes made)
variable customer_share was byte now float
(449,618 real changes made)
(0 real changes made)
variable presence_share was byte now float
(366,328 real changes made)
(0 real changes made)
variable communication_share was byte now float
(449,618 real changes made)
(0 real changes made)
variable affected_share was byte now float
(449,618 real changes made)
(0 real changes made)
variable face2face_share was byte now float
(449,618 real changes made)
(0 real changes made)

. collapse (first) population_density employment_density (sum) `indexes' establ
> ishments employment employment_weight, by(zip)

. foreach X of var `indexes' {
  2.         replace `X' = `X' / employment_weight
  3. }
(26,741 real changes made, 2,409 to missing)
(26,741 real changes made, 2,409 to missing)
(26,392 real changes made, 2,409 to missing)
(26,741 real changes made, 2,409 to missing)
(26,741 real changes made, 2,409 to missing)
(26,741 real changes made, 2,409 to missing)

. generate plant_size = employment / establishments

. 
. * merge coordinates
. merge 1:1 zip using "../data/clean/geonames/us-zip-codes.dta", nogen keep(mas
> ter match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  
        from using                          0  

    matched                            26,740  
    -----------------------------------------

. 
. local vars zip latitude longitude population_density employment_density plant
> _size employment `indexes' 

. keep `vars'

. order `vars'

. * round values for presentation
. replace plant_size = plant_size*10
(26,741 real changes made)

. foreach X of var population_density employment_density plant_size `indexes' {
  2.         replace `X' = round(`X')
  3. }
(24,267 real changes made)
(24,354 real changes made)
(23,430 real changes made)
(23,603 real changes made)
(22,949 real changes made)
(23,016 real changes made)
(24,130 real changes made)
(24,195 real changes made)
(23,536 real changes made)

. replace plant_size = plant_size/10
(26,741 real changes made)

. foreach X of var latitude longitude {
  2.         replace `X' = round(`X'*10000)/10000
  3. }
(0 real changes made)
(0 real changes made)

. 
. sort zip

. generate zip_code = string(zip,"%05.0f")

. drop zip

. order zip_code

. export delimited "../data/derived/location-index.csv", replace
(note: file ../data/derived/location-index.csv not found)
file ../data/derived/location-index.csv saved

. 
. *drop rural areas, CBP is not representative for these
. drop if population_density<10 | employment<50
(8,008 observations deleted)

. 
. generate ln_density = ln(population_density)
(1,001 missing values generated)

. foreach X of var *_share {
  2.         lowess `X' ln_density, bw(0.5) generate(`X'_hat)
  3. }

. 
. do "fig4.do"

. graph drop _all

. 
. line teamwork_share_hat customer_share_hat presence_share_hat population_dens
> ity, sort ///
> ytitle("Share of workers (percent)") xtitle("Population density (person/km2, 
> log scale)") ///
> scheme(s2mono) graphregion(color(white)) xscale(log) xlabel(10 100 1000 10000
>  100000) ///
> legend(region(lstyle(none)) bplacement(5) order(1 "Teamwork" 2 "Customer cont
> act" 3 "Physical presence")) 

. 
. graph export "../text/fig4.eps", replace
(file ../text/fig4.eps written in EPS format)

. graph export "../text/fig4.pdf", replace
(file ../text/fig4.pdf written in PDF format)

. 
end of do-file

. 
end of do-file
