
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do scatter_customers_teamwork_byoccupation.do 

. clear all

. use "../data/derived/occupation/risks.dta", clear

. 
. 
. cap drop label_occup2

. gen label_occup2=""
(764 missing values generated)

. 
. replace label_occup2="Healthcare social workers"  if   SOCCode=="21-1022"
variable label_occup2 was str1 now str25
(1 real change made)

. 
. replace label_occup2="Textile machine operators" if SOCCode=="51-6061"
(1 real change made)

. 
. replace label_occup2="Postal service mail carriers" if  SOCCode=="43-5052"
variable label_occup2 was str25 now str28
(1 real change made)

. replace label_occup2="Chemical equipment operators" if    SOCCode=="51-9011"
(1 real change made)

. replace label_occup2="Insurance sales agents" if   SOCCode=="41-3021"
(1 real change made)

. *replace label_occup2="Police officers" if SOCCode=="33-3051"
. 
. replace label_occup2="Surgeons" if SOCCode=="29-1067"
(1 real change made)

. replace label_occup2="Dentists" if SOCCode=="29-1021"
(1 real change made)

. 
. 
. replace label_occup2="Psychiatrists"  if SOCCode=="29-1066"
(1 real change made)

. replace label_occup2="Firefighters"  if SOCCode=="33-2011"
(1 real change made)

. replace label_occup2="Nuclear power reactor operators" if  SOCCode=="51-8011"
variable label_occup2 was str28 now str31
(1 real change made)

. replace label_occup2="Couriers" if  SOCCode=="43-5021"
(1 real change made)

. 
. replace label_occup2="Chefs and head cooks"   if  SOCCode=="35-1011"
(1 real change made)

. replace label_occup2="Athletic trainers"  if  SOCCode=="29-9091"
(1 real change made)

. replace label_occup2="Elementary school teachers"  if  SOCCode=="25-2021"
(1 real change made)

. 
. 
. 
. 
. 
. 
. 
. scatter customer_index teamwork_index if (customer_index>0 & teamwork_index>0
> ), graphregion(color(white)) msymbol(circle_hollow) ///
> ytitle("Customer contact") xtitle("Teamwork") mlabel(label_occup2) graphregio
> n(margin(3 15 1 3))

. 
. 
. graph export "../text/fig3.eps", replace
(file ../text/fig3.eps written in EPS format)

. graph export "../text/fig3.pdf", replace
(file ../text/fig3.pdf written in PDF format)

. 
end of do-file
