
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501706328764
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do scatterplot_validation_customer_atus.do 

. clear all

. use "../data/derived/occupation/risks.dta", clear

. 
. * aggregate to ATUS occupation categories
. collapse (mean) customer_index customer_interact_index can_wh (firstnm) SOCCo
> de, by(census2010)

. 
. * use percent everywhere
. replace can_wh = 100 * can_wh
(277 real changes made)

. * add random noise so more can be seen in figure
. set seed 1

. replace can_wh = can_wh + 2 * (uniform() - 0.5)
(443 real changes made)

. 
. generate label_customer=""
(444 missing values generated)

. *replace label_customer="Education administrators" if SOCCode=="11-9032"
. *replace label_customer="Genetic counselors" if SOCCode=="29-9092"
. replace label_customer="Fundraisers" if SOCCode=="13-1131"
variable label_customer was str1 now str11
(1 real change made)

. replace label_customer="Morticians, Undertakers, and Funeral Directors" if SO
> CCode=="39-4031"
variable label_customer was str11 now str46
(1 real change made)

. replace label_customer="Proofreaders and Copy Markers" if SOCCode=="43-9081"
(1 real change made)

. *replace label_customer="Software developers" if SOCCode=="15-1133"
. 
. 
. generate label_customer_interact=""
(444 missing values generated)

. *replace label_customer_interact="Industrial machinery mechanics"  if SOCCode
> =="49-9041"
. replace label_customer_interact="Cleaners of vehicles and equipment"  if SOCC
> ode=="53-7061"
variable label_customer_interact was str1 now str34
(1 real change made)

. replace label_customer_interact="Healthcare social workers"  if SOCCode=="21-
> 1022"
(0 real changes made)

. *replace label_customer_interact="Oral and maxillofacial surgeons"  if SOCCod
> e=="29-1022"
. replace label_customer_interact="Dentists"  if SOCCode=="29-1021"
(1 real change made)

. replace label_customer_interact="Directors, religious act. and educ."  if SOC
> Code=="21-2021"
variable label_customer_interact was str34 now str35
(1 real change made)

. 
. twoway (scatter customer_interact_index can_wh if customer_interact_index>0, 
> msymbol(O) mlabel(label_customer_interact)) ///
>         (scatter customer_index can_wh if customer_index>0 & customer_interac
> t_index==0, msymbol(Oh) mlabel(label_customer) ) ///
>         , graphregion(color(white)) scheme(s2mono)  ///
>         legend(order(1 "Face to face" 2 "Emails and memos"))  graphregion(mar
> gin(3 15 1 3)) ytitle("Customer interaction index") xtitle("Share of workers 
> who are able to work from home") 

. 
. 
. graph export "../text/customer_atus_validation.eps", replace
(file ../text/customer_atus_validation.eps not found)
file ../text/customer_atus_validation.eps saved as EPS format

. graph export "../text/customer_atus_validation.pdf", replace
file ../text/customer_atus_validation.pdf saved as PDF format

. 
end of do-file
