
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501606204617
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do aggregate_risk_by_naics.do 

. clear all

. use "../../clean/employment-matrix/matrix.dta"

. 
. local indexes teamwork customer presence

. 
. merge m:1 SOCCode using "risks.dta", keep(master match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                           607
        from master                       607  
        from using                          0  

    matched                            13,400  
    -----------------------------------------

. * a few cases are missing the risk, take these to be low risk
. mvencode `indexes' remote, mv(0) override
    teamwork: 607 missing values recoded
    customer: 607 missing values recoded
    presence: 607 missing values recoded
      remote: 607 missing values recoded

. 
. replace Employment = round(Employment*1000)
(14,007 real changes made)

. compress
  variable Employment was double now long
  (56,028 bytes saved)

. 
. * both or all three
. generate byte communication = teamwork | customer

. generate byte affected = communication | presence

. * share of workers communicating but not remotely
. generate byte face2face = communication & !remote

. 
. foreach X of var `indexes' communication affected face2face {
  2.         generate double `X'_share = `X' * Employment
  3. }

. collapse (sum) Employment teamwork_share customer_share presence_share commun
> ication_share affected_share face2face_share, by(industry_code)

. foreach X in `indexes' communication affected face2face {
  2.         replace `X'_share = round(`X'_share / Employment * 100)
  3. }
(84 real changes made)
(84 real changes made)
(84 real changes made)
(84 real changes made)
(84 real changes made)
(84 real changes made)

. drop Employment

. 
. export delimited "naics_risk.csv", replace
(note: file naics_risk.csv not found)
file naics_risk.csv saved

. 
end of do-file
